Practical - 3



Program/Notebook to demonstrate dat wragling in python using A) Series B) Timedelta

#### Series

In [ ]:
#Importing Required Python Libraries
import pandas as pd
import numpy as np

In [ ]:
#Creating Series from a numpy array
Array = np.array(['v', 'i', 's', 'k', 'a', 'p', 'l', 'w'])
Data = pd.Series(Array)
Data

0    v
1    i
2    s
3    k
4    a
5    p
6    l
7    w
dtype: object

In [ ]:
df = pd.read_excel("Book1.xlsx")
df.head(2)

,Sr.,Enrollment No.,Name of Student,CA-I (10marks),CA-II (10marks),Midterm (20marks),UT1,OEA,Midsem split
0,1,2054491246001,AAKANKSHA ANIL SALUNKE,8,8,18,6,8,6
1,2,2054491246002,ABHINASH KAILASH JOSHI,8,9,18,7,8,4

In [ ]:
#Converting UT1 column into series of  Book1.xlsx
Ser = pd.Series(df['UT1'])
#Sorting Values of UT1
Ser.head().sort_values()

0    6
2    6
1    7
3    8
4    8
Name: UT1, dtype: int64

In [ ]:
#Reading from 1th index to 4th index rows only
df.iloc[1: 4]

,Sr.,Enrollment No.,Name of Student,CA-I (10marks),CA-II (10marks),Midterm (20marks),UT1,OEA,Midsem split
1,2,2054491246002,ABHINASH KAILASH JOSHI,8,9,18,7,8,4
2,3,2054491246003,ADITYA JITENDRA MALI,6,8,14,6,8,4
3,4,2054491246004,AISHWARYA AVINASH PATIL,9,9,19,8,8,5

In [ ]:
#Counting Total values in for each columns in Book1.xlsx
df.count()

Sr.                   67
Enrollment No.        67
Name of Student       67
CA-I (10marks)        67
CA-II (10marks)       67
Midterm (20marks)     67
UT1                   67
OEA                   67
Midsem split          67
dtype: int64

In [ ]:
print("Shape = ",df.shape)

Shape =  (67, 9)

In [ ]:
print("Size = ",df.size)

Size =  603

In [ ]:
print("DataFrame Dimension = ",df.ndim)

DataFrame Dimension =  2

In [ ]:
print("Total Memory Occupied= ",df.memory_usage())

Total Memory Occupied=  Index                 128
Sr.                   536
Enrollment No.        536
Name of Student       536
CA-I (10marks)        536
CA-II (10marks)       536
Midterm (20marks)     536
UT1                   536
OEA                   536
Midsem split          536
dtype: int64

In [ ]:
#Changing Name of Column
NC  = pd.Series(df['UT1'], name='UT Test 1')
NC.head(3)

0    6
1    7
2    6
Name: UT Test 1, dtype: int64

#### Timedelta

In [ ]:
#Importing Required Libraries
import pandas as pd

In [ ]:
#Creating a timedelta object by passing a string literal
print(pd.Timedelta('5 days 8 hours 45 minutes 30 seconds'))

5 days 08:45:30

In [ ]:
#Create a timedeltaobject by passing an integer, with the unit
print(pd.Timedelta(6, unit='h'))

0 days 06:00:00

In [ ]:
#data offsets
print(pd.Timedelta(days=5))
print(pd.Timedelta(hours=5))
print(pd.Timedelta(days=5, hours=4, minutes=2, seconds=30))

5 days 00:00:00
0 days 05:00:00
5 days 04:02:30